In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "HeroesOfPymoli/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [127]:
player_count = purchase_data["SN"].value_counts()
player_count = len(player_count)
print(player_count)

576

In [96]:
# Player Count
players_df = pd.DataFrame(columns = ["Total Players"])
players_df["Total Players"] = [purchase_data["SN"].nunique()]
players_df

   Total Players
0            576

In [142]:
### Purchasing Analysis (Total)
purchasing_df = pd.DataFrame()

# Number of Unique Items
unique_items = purchase_data["Item ID"].nunique()

purchasing_df["Number of Unique Items"] = [unique_items]

# Avg price
avg_price = purchase_data["Price"].mean()

purchasing_df["Average Price"] = [avg_price]

# Number of Purchases
total_purchases = purchase_data["Purchase ID"].count()

purchasing_df["Number of Purchases"] = [total_purchases]

# total revenue
total_revenue = purchase_data["Price"].sum()

purchasing_df["Total Revenue"] = [total_revenue]


purchasing_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [143]:
### Gender Demogrpahics
gender_df = pd.DataFrame()

# removing duplicate SN's 
noduplicates_df = purchase_data.drop_duplicates(subset = ["SN"])

# getting gender counts
gender_values = noduplicates_df["Gender"].value_counts().tolist()

# creating columns
gender_df["Total Count"] = [gender_values [0]]

gender_df

   Total Count
0          484

In [144]:
result = pd.DataFrame({"Gender":["Male", "Female","Other / Non-Disclosed"], "Total Count": gender_values})
result

player_total = sum(gender_values)

In [145]:
result["Percentage of Players"] = round((result["Total Count"] / player_total)*100,2)


result

                  Gender  Total Count  Percentage of Players
0                   Male          484                  84.03
1                 Female           81                  14.06
2  Other / Non-Disclosed           11                   1.91

In [146]:
result = result.set_index("Gender")

In [147]:
result

                       Total Count  Percentage of Players
Gender
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [148]:
### Purchasing Analysis (GENDER)

noduplicates_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [149]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [150]:
##  - Grouping 
import numpy as np
purchase_data.groupby(['Gender'])['Price'].agg(np.mean)

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [151]:
#noduplicates_df.groupby('Gender').count()
# noduplicates_df.groupby(['Gender'])['Purchase ID'].agg(np.sum)
purchase_data['Gender'].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [152]:
pd_df = purchase_data.groupby(['Gender']).agg({'Price':['count','mean','sum']})
pd_df

                      Price
                      count      mean      sum
Gender
Female                  113  3.203009   361.94
Male                    652  3.017853  1967.64
Other / Non-Disclosed    15  3.346000    50.19

In [153]:
#  dropping "Price" from summary
pd_df = pd_df.droplevel(0, axis=1)
pd_df

                       count      mean      sum
Gender
Female                   113  3.203009   361.94
Male                     652  3.017853  1967.64
Other / Non-Disclosed     15  3.346000    50.19

In [154]:
# renaming columns

pd_df.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']
pd_df

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [156]:
purchase_data.shape

(780, 8)

In [157]:
result

                       Total Count  Percentage of Players
Gender
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [158]:
# merging data frames
df_merge = pd.merge(pd_df, result, left_index=True, right_index=True)
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Total Count,Percentage of Players
Gender,,,,,
Female,113,3.203009,361.94,81,14.06
Male,652,3.017853,1967.64,484,84.03
Other / Non-Disclosed,15,3.346000,50.19,11,1.91

In [159]:
df_merge['Average Total Purchase per Person'] = df_merge['Total Purchase Value']/df_merge['Total Count']
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Total Count,Percentage of Players,Average Total Purchase per Person
Gender,,,,,,
Female,113,3.203009,361.94,81,14.06,4.468395
Male,652,3.017853,1967.64,484,84.03,4.065372
Other / Non-Disclosed,15,3.346000,50.19,11,1.91,4.562727

In [160]:
del df_merge['Percentage of Players']
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Total Count,Average Total Purchase per Person
Gender,,,,,
Female,113,3.203009,361.94,81,4.468395
Male,652,3.017853,1967.64,484,4.065372
Other / Non-Disclosed,15,3.346000,50.19,11,4.562727

In [161]:
del df_merge['Total Count']
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [162]:
# fixing last column name
df_merge.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value', "Average Total Purchase per Person"]
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [163]:
### Age Demogrpahics
# Create the bins in which Data will be held

bins=[0, 9, 14, 19, 24, 29, 34, 39, 1000]
labels= ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], bins, labels=labels, include_lowest=True)

less_than_ten = purchase_data.loc[(purchase_data["Age Range"]== "<10")]
less_than_ten_count = len(less_than_ten['SN'].unique())
less_than_ten_percent = "{:.2%}".format(less_than_ten_count/player_count)

ten_to_fourteen = purchase_data.loc[(purchase_data["Age Range"]== "10-14")]
ten_to_fourteen_count = len(ten_to_fourteen['SN'].unique())
ten_to_fourteen_percent = "{:.2%}".format(ten_to_fourteen_count/player_count)

fifteen_to_nineteen = purchase_data.loc[(purchase_data["Age Range"]== "15-19")]
fifteen_to_nineteen_count = len(fifteen_to_nineteen['SN'].unique())
fifteen_to_nineteen_percent = "{:.2%}".format(fifteen_to_nineteen_count/player_count)

twenty_to_twentyfour = purchase_data.loc[(purchase_data["Age Range"]== "20-24")]
twenty_to_twentyfour_count = len(twenty_to_twentyfour['SN'].unique())
twenty_to_twentyfour_percent = "{:.2%}".format(twenty_to_twentyfour_count/player_count)

twentyfive_to_twentynine = purchase_data.loc[(purchase_data["Age Range"]== "25-29")]
twentyfive_to_twentynine_count = len(twentyfive_to_twentynine['SN'].unique())
twentyfive_to_twentynine_percent = "{:.2%}".format(twentyfive_to_twentynine_count/player_count)

thirty_to_thirtyfour = purchase_data.loc[(purchase_data["Age Range"]== "30-34")]
thirty_to_thirtyfour_count = len(thirty_to_thirtyfour['SN'].unique())
thirty_to_thirtyfour_percent = "{:.2%}".format(thirty_to_thirtyfour_count/player_count)

thirtyfive_to_thirtynine = purchase_data.loc[(purchase_data["Age Range"]== "35-39")]
thirtyfive_to_thirtynine_count = len(thirtyfive_to_thirtynine['SN'].unique())
thirtyfive_to_thirtynine_percent = "{:.2%}".format(thirtyfive_to_thirtynine_count/player_count)

forty_or_more = purchase_data.loc[(purchase_data["Age Range"]== "40+")]
forty_or_more_count = len(forty_or_more['SN'].unique())
forty_or_more_percent = "{:.2%}".format(forty_or_more_count/player_count)


# Take results and make new dataframe of bins
age_df = pd.DataFrame({
    "Age Range" : ("<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", "40+"),
    
    "Total Count" : [less_than_ten_count, ten_to_fourteen_count,fifteen_to_nineteen_count,twenty_to_twentyfour_count,
                    twentyfive_to_twentynine_count,thirty_to_thirtyfour_count,thirtyfive_to_thirtynine_count,
                    forty_or_more_count],
    
    "Percentage of Players" : [less_than_ten_percent,ten_to_fourteen_percent,fifteen_to_nineteen_percent,
                               twenty_to_twentyfour_percent,twentyfive_to_twentynine_percent,thirty_to_thirtyfour_percent,
                               thirtyfive_to_thirtynine_percent,forty_or_more_percent]
})

age_df

  Age Range  Total Count Percentage of Players
0       <10           17                 2.95%
1     10-14           22                 3.82%
2     15-19          107                18.58%
3     20-24          258                44.79%
4     25-29           77                13.37%
5     30-34           52                 9.03%
6     35-39           31                 5.38%
7       40+           12                 2.08%

In [186]:
### Age Demoogrpahics (Purchasing Analysis)

bins=[0, 9, 14, 19, 24, 29, 34, 39, 1000]
labels= ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], bins, labels=labels, include_lowest=True)


purchase_data.groupby(['Age'])['Price'].agg(np.mean)

Age
7     3.654444
8     3.246250
9     3.045000
10    3.536667
11    2.684286
12    2.633333
13    2.362500
14    3.455000
15    3.018571
16    3.018667
17    2.930909
18    3.162308
19    3.042609
20    3.174949
21    2.915161
22    2.955000
23    3.013881
24    3.137612
25    3.083051
26    2.870714
27    2.723000
28    1.690000
29    2.710000
30    3.152000
31    3.435714
32    2.836250
33    2.486429
34    2.458889
35    3.716429
36    2.532000
37    3.644286
38    3.794444
39    3.886667
40    2.785000
41    3.270000
42    3.930000
43    4.000000
44    2.680000
45    1.700000
Name: Price, dtype: float64